Revit 2026 API

# DimensionTypePrefix Property

---

The prefix text for the dimension value.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public string Prefix { get; set; }
```
```vb
Public Property Prefix As String
	Get
	Set
```
```cpp
public:
property String^ Prefix {
	String^ get ();
	void set (String^ value);
}
```
```fsharp
member Prefix : string with get, set
```

#### Property Value

String

| Exception | Condition |
| --- | --- |
| ArgumentNullException | When setting this property: A non-optional argument was null |

The text goes immediately before the value and is not overridden by the possible instance prefix.

#### Reference

DimensionType Class

Autodesk.Revit.DB Namespace